---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Period
source: html/56c325ba-130d-de99-69ad-eeeee2ae76c0.htm
---
# Autodesk.Revit.DB.SpecTypeId.Period Property

Period, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId Period { get; }
```